In [1]:
# import all necessary libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [15]:
df = pd.read_csv('code_survey.csv')
df.head()

/anaconda3/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3049: DtypeWarning: Columns (0,2,19) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,age,experience,salary,sql,javascript,css,c#,java,php,c,...,wordpress,ios,lamp,mongodb,cloud,.net,react.js,typescript,swift,bash
0,< 20,<2,Student / Unemployed,0,1,0.0,0,0,0,0.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,25-29,41310,NaN,1,0,0.0,0,1,0,1.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,25-29,41435,NaN,1,1,0.0,0,1,0,0.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,< 20,41310,Student / Unemployed,0,0,0.0,0,1,0,0.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,35-39,11,"$80,000 - $100,000",1,1,1.0,0,1,1,1.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 347687 entries, 0 to 347686
Data columns (total 33 columns):
age            250815 non-null object
experience     292946 non-null object
salary         203578 non-null object
sql            347687 non-null int64
javascript     347687 non-null int64
css            107911 non-null float64
c#             347687 non-null int64
java           347687 non-null int64
php            347687 non-null int64
c              258804 non-null float64
c++            347687 non-null int64
python         347687 non-null int64
ruby           77833 non-null float64
perl           9056 non-null float64
year           347687 non-null int64
html           193981 non-null float64
objective-c    23628 non-null float64
jquery         98625 non-null float64
node.js        338631 non-null float64
gender         273598 non-null object
sql server     82116 non-null float64
android        82116 non-null float64
angular.js     321246 non-null float64
wordpress      26086 non-null float64
ios            26086 non-null float64
lamp           82116 non-null float64
mongodb        56030 non-null float64
cloud          56030 non-null float64
.net           239130 non-null float64
react.js       239130 non-null float64
typescript     140275 non-null float64
swift          51392 non-null float64
bash           187738 non-null float64
dtypes: float64(21), int64(8), object(4)
memory usage: 87.5+ MB

## Data Analysis

In [21]:
# look at numbers for languages on a yearly basis as a proportion of total
# Note: total proportion will be > 1 as there are more than one responses by a single respondent

df.groupby('year').java.agg(['sum', 'count', 'mean'])

        sum  count      mean
year
2011    861   2813  0.306079
2012   2348   6243  0.376101
2013   3020   9742  0.309998
2014   2479   7643  0.324349
2015   8219  26086  0.315073
2016  17942  56030  0.320221
2017  14524  51392  0.282612
2018  35521  98855  0.359324
2019  35917  88883  0.404093